'''11. Дані про температуру води на Чорноморському узбережжі за декаду
вересня зберігаються в масиві. Визначити, скільки за цей час було днів, придатних для
купання.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(10, 27, 10)
print(f'Температура води за декаду вересня: {A}.\n')
sum = 0
for i in A:
    if (i > 20): # рахуємо, що вода більше 20 градусів - придатна до купання; якщо такий елемент зустрічається добавляємо +1 до лічильника
        sum += 1

print(f'Придатна температура для купання - більше 20 градусів.\n{sum} дня(ів) було придатних для купання.') # вивід