'''12. Дані про температуру повітря за декаду грудня зберігаються в масиві.
Визначити, скільки раз температура була вище середньої за цю декаду.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(-20, 5, 10)
print(f'Температура за декаду грудня: {A}.\n')
sum = 0
for i in A:
    if (i > A.mean()): # якщо елемент більший за середній по масиву додаємо +1 до лічильника
        sum += 1

print(f'Середня температура: {A.mean()}\n{sum} раз(ів) температура була вищою за середню.') # вивід