'''16. Знайти добуток елементів масиву цілих чисел, які кратні 7. Розмірність
масиву - 15. Заповнення масиву здійснити випадковими числами від 10 до 50.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(10, 50, 15)
print(f'Вихідний масив: {A}.\n')

prod = 1 # задаємо добуток як 1 (якщо нуль - добуток завжди буде давати також нуль)
for i in A:
    if (i % 7 == 0): # перевіряємо кратність 7
         prod *= i # якщо істине, перемножуємо

if (prod != 1): # якщо добуток не дорівнює 1 (початкове значення), виводимо його
    print(f'Добуток елементів, кратних 7: {prod}.')
else: # інакше - елементів кратних 7 в масиві немає, що й виводимо
    print('Немає елементів, кратних 7.')