'''17. Знайти суму елементів масиву дійсних чисел, що мають непарні номери.
Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 100
до 200.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.uniform(100, 200, 20) # створюємо масив із дійсних чисел за допомогою random.uniform
print(f'Вихідний масив: {A}.\n')

sum = 0
for i in range (1, 20, 2): # за допомогою range проходимо усі непарні номери
    sum += A[i] # і додаємо

print(f'Сума непарних елементів: {sum}.') # вивід