'''19. Знайти суму всіх елементів масиву цілих чисел що задовольняють умові:
остача від ділення на 2 дорівнює 3. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 200 до 300.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(200, 300, 20)
print(f'Вихідний масив: {A}.\n')

sum = 0
for i in A:
    if (i % 2 == 3): # перевіряємо остачу від ділення
        sum += i # якщо задовільняє, додаємо до суми

print(f'Сума елементів, що задовільняють умові: {sum}.') # вивід
print(f'Сума елементів завжди буде дорівнювати нулю, незалежно від вхідного масиву. Оскільки не може існувати остача від ділення, що більша за дільник.')