'''2. Введіть з клавіатури п'ять цілочисельних елементів масиву x. Виведіть на
екран значення коріння і квадратів кожного з елементів масиву.
Виконав: Лещенко В. О.'''

import numpy as np
from math import sqrt # імпортуємо функцію sqrt з math

X = np.zeros(5, dtype=int)
for i in range(5):
    X[i] = int(input(f'x[{i+1}] = '))
for i in range(5): # проходячись по кожному елементу масиву виводимо його корінь і квадрат
    print(f'Корінь {i+1}-го елемента: {sqrt(X[i])}; \nКвадрат {i+1}-го елемента: {X[i]**2}.\n')