'''20. Знайти суму всіх елементів масиву дійсних чисел, більших за задане
число. Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами
від 50 до 100.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.uniform(50, 100, 20)
print(f'Вихідний масив: {A}.\n')

sum = 0
number = float(input('Введіть задане число: ')) # користувач вводить число
for i in A:
    if (i > number): # якщо елемент більший за задане число, додаємо до суми
        sum += i

if (sum != 0): # якщо сума не дорівнює нулю - виводимо
    print(f'Сума елементів, більших за задане число: {sum}.')
else: # інакше - немає таких чисел
    print('Немає чисел, білиших за задане.')