'''21. Знайти добуток всіх елементів масиву дійсних чисел, менших заданого
числа. Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами
від 50 до 100.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.uniform(50, 100, 10)
print(f'Вихідний масив: {A}.\n')

prod = 1
number = float(input('Введіть задане число: '))
for i in A:
    if (i < number): # якщо число менше за задане, перемножуємо його
        prod *= i

if (prod != 1): # якщо добуток не 1, виводимо
    print(f'Добуток елементів, менших за задане число: {prod}.')
else: # інакше - не було чисел, які треба було перемножити
    print('Немає чисел, менших за задане.')