'''22. Знайти добуток елементів масиву, кратних 3 і 9. Розмірність масиву - 10.
Заповнення масиву здійснити випадковими числами від 5 до 500.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(5, 500, 10)
print(f'Вихідний масив: {A}.\n')

prod = 1
for i in A:
    if (i % 3 == 0 and i % 9 == 0): # перевіряємо на кратність і перемножуємо
        prod *= i

if (prod != 1):
    print(f'Добуток елементів, що задовільняють умові: {prod}.')
else:
    print('Немає чисел, що задовільняють умові.')