'''24. Знайти суму елементів масиву цілих чисел, які діляться на 5 і на 8
одночасно. Розмірність масиву - 30. Заповнення масиву здійснити випадковими
числами від 500 до 1000.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(500, 1000, 30)
print(f'Вихідний масив: {A}.\n')

sum = 0
for i in A:
    if (i % 5 == 0 and i % 8 == 0): # перевіряємо на кратність і додаємо
        sum += i

if (sum != 0):
    print(f'Сума елементів, що задовільняють умові: {sum}.')
else:
    print('Немає чисел, що задовільняють умові.')