'''26. Напишіть програму аналізу значень температури хворого за добу:
визначте мінімальне і максимальне значення, середнє арифметичне. Заміри
температури виробляються шість раз на добу і результати вводяться з клавіатури у
масив T.
Виконав: Лещенко В. О.'''

import numpy as np

T = np.zeros(6)
for i in range(6):
    T[i] = float(input(f'{i + 1}-й замір: ')) # користувач вводить заміри щогодинно
print(f'\nТемпература за добу: {T}.\n') # вивід всіх значень

print(f'Максимальне значення: {T.max()}.') # максимальне значення - метод max
print(f'Мінімальне значення: {T.min()}.') # мінімальне - min
print(f'Середнє значення: {T.mean()}.') # середнє - mean