'''27. Лінійний масив містить відомості про кількість опадів, що випали за
кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
Виконав: Лещенко В. О.'''

from enum import Enum # імпортуємо Enum для того, щоб вивести назву місяця по індексу
import numpy as np

class month(Enum):
    Січень = 0
    Лютий = 1
    Березень = 2
    Квітень = 3
    Травень = 4
    Червень = 5
    Липень = 6
    Серпень = 7
    Вересень = 8
    Жовтень = 9
    Листопад = 10
    Грудень = 11
A = np.array([45, 39, 33, 26, 34, 37, 22, 28, 49, 48, 39, 29])
print(f'Масив опадів за місяці: {A}.\n')

sum = 0
for i in A:
    if (i < 30): # якщо температура менше 30 - додаємо місяць до посушливих
        sum += 1
print(f'Загальна кількість опадів протягом року: {A.sum()}.')
print(f'Середньомісячна кількість опадів: {A.mean()}.')
print(f'Кількість посушливих місяців: {sum}.')
print(f'Найпосушливіший місяць року: {month(list(A).index(A.min())).name}.') # за допомогою index і min знаходимо найпосушливіший місяць і виводимо його ім'я за допомогою name




