'''29. Знайти кількість парних елементів одновимірного масиву до першого
зустрінутого числа рівного наперед заданому числу а.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(0, 200, 15)
print(f'Вихідний масив: {A}.\n')

sum = 0
a = int(input('Введіть число а: ')) # користувач вводить число
for i in A:
    if (i != a): # поки не зустрічаємо число, цикл працює
        if (i % 2 == 0): # якщо елемент парний, додаємо до лічильника
            sum += 1
    else:
        break # якщо зустрічаємо число - вихід із циклу

if (sum != 0):
    print(f'Кількість парних елементів масиву до числа а: {sum}.')
else:
    print('Парних елементів до числа а немає.')