'''30. Обчислити середнє арифметичне значення тих елементів одновимірного
масиву, які розташовані за першим по порядку мінімальним елементом.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(0, 200, 15)
print(f'Вихідний масив: {A}.\n')

min_index = list(A).index(A.min())
print(f'Мінімальний елемент масиву: {A.min()}.')
print(f'Його індекс: {min_index}.')
if (min_index == len(A) - 2): # якщо мінімальний елемент на передостанній позиції - то середнє арифметичне після нього буде - останній елемент
    print(f'Середнє арифметичне: {A[-1]}.')
elif (min_index != len(A) - 1): # якщо мінімальний елемент не на останній чи передостанній позиції, то знаходимо середнє арифметичне за допомогою зрізу і методу mean
    print(f'Середнє арифметичне: {A[min_index+1 : len(A)].mean()}.')
else: # інакше - мінімальний елемент на останній позиції
    print('Мінімальне значення стоїть на останній позиції, отже неможливо знайти середнє значення елементів після нього.')
