'''31. Обчислити середнє арифметичне значення тих елементів одновимірного
масиву, які потрапляють в інтервал від -2 до 10.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(-10, 30, 15)
print(f'Вихідний масив: {A}.\n')

sum = 0
count = 0
for i in A:
    if (-2 <= i <= 10): # якщо елемент потрапляє в діапазон, додаємо його до суми, і +1 до лічильника
        sum += i
        count += 1

print(f'Середнє арифметичне: {sum / count}.') # виводимо середнє арифметичне, поділивши суму на кількість таких елементів