'''34. Дано два лінійних масиву однакової розмірності. Скласти третій масив з
добутку елементів перших двох масивів, що стоять на місцях з однаковим індексом.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(-10, 10, 10)
B = np.random.randint(0, 20, 10)
print(f'Вихідний масив A: {A}.')
print(f'Вихідний масив B: {B}.\n')

C = A * B # третій масив = добуток двох вихідних
print(f'Добуток масивів: {C}.') # вивід