'''38. Дані про направлення вітру (північний, південний, східний, західний) і
силі вітру за декаду листопада зберігаються в масиві. Визначити, скільки днів дув
південний вітер з силою, що перевищує 8 м / с.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.array(['пд', 'сх', 'пн', 'сх', 'зх', 'пд', 'зх', 'пд', 'сх', 'зх'])
B = np.array([6, 9, 7, 9, 3, 12, 8, 9, 5, 4])

sum = 0
for i in range(len(B)):
    if (B[i] > 8 and A[i] == 'пд'): # перевіряємо умову, якщо істинна - +1 до лічильника
        sum += 1

print(f'Днів, коли був південний вітер з силою, що перевищує 8 м/с: {sum}.') # вивід