'''39. Дані про температуру повітря і кількості опадів за декаду квітня
зберігаються в масивах. Визначити кількість опадів, що випали у вигляді дощу і у
вигляді снігу за цю декаду.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.array([49, 36, 32, 45, 51, 47, 40, 45, 63, 46]) # кількість опадів
B = np.array([15, 12, 11, 4, 2, 2, -1, 0, 4, 9]) # температура

sum = 0
for i in range(len(B)):
    if (B[i] > 0): # якщо температура більше 0, опади будуть у вигляді доща
        sum += A[i]

print(f'Кількість опадів у вигляді дощу: {sum}.')
print(f'Кількість опадів у вигляді снігу: {A.sum() - sum}.') # опади у вигляді снігу = загальна кількість опадів - кількість опадів у вигляді доща