'''40. Обчислити суму парних елементів одновимірного масиву до першого
зустрінутого нульового елемента.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(0, 20, 15)
print(f'Вихідний масив: {A}.\n')

sum = 0
for i in A:
    if (i != 0): # якщо елемент не нульовий, цикл працює
        if (i % 2 == 0): # якщо елемент парний - додаємо
            sum += i
    else:
        break # при зутрічі нуля - цикл припиняється
else:
    print('Нульовий елемент відсутній в масиві.') # якщо цикл припинився без break, то нульовий елемент не був зустрінутий в масиві
    print(f'Сума парних елементів: {sum}.')
    exit(0)

print(f'Сума парних елементів до нуля: {sum}.')