'''41. Змінній t привласнити значення істина, якщо максимальний елемент
одновимірного масиву єдиний і не перевищує наперед заданого числа а.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(0, 30, 15)
print(f'Вихідний масив: {A}.\n')

a = int(input('Введіть число а: ')) # користувач вводить число
if (list(A).count(A.max()) == 1 and A.max() <= a): # якщо максимальний елемент один, і не перебільшує задане число, т = істинна
    t = True
else: # інакше т = хиба
    t = False

print(t) # вивід

