'''43. Задано два натуральних числа a і b. Змінній w привласнити значення
істина, якщо в одновимірному цілочисельному масиві є хоча б один елемент, кратний а
і не кратний b.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(0, 30, 15)
print(f'Вихідний масив: {A}.\n')

a, b = int(input('Введіть число а: ')), int(input('Введіть число b: ')) # користувач вводить числа
for i in A:
    if (i % a == 0 and i % b != 0): # перевіряємо умову
        w = True
        break
    else:
        w = False

print(w)
