'''47. У лінійному масиві знайти максимальний елемент. Вставте порядковий
номер елемента за ним, пересунувши всі залишилися на одну позицію вправо.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(0, 20, 15)
print(f'Вихідний масив: {A}.\n')

A_list = list(A) # робимо список, що можна було застосувати insert
max_index = A_list.index(A.max()) # знаходимо індекс максимального елемента
A_list.insert(max_index + 1, max_index) # вставляємо його індекс за ним
print(f'Після виконання: {np.array(A_list)}.') # знову повертаємось і виводимо масив
