'''48. Наведено список прізвищ брокерів товарної біржі з N чоловік. Поміняйте
місцями прізвища брокерів: першого і останнього, другого і передостаннього, третього
з початку і третього від кінця і т.д.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.array(['Трофімов', 'Сидоренко', 'Іванов', 'Карпенко', 'Демчук', 'Макаров', "Петренко"])
print(f'Прізвища до зміни: {A}.\n')

for i in range(len(A) // 2): # міняємо прізвища до середини масиву (якщо далі, вони знову стануть на ті місця, що були і до зміни, тобто перестановка не відбудеться)
    A[i], A[-(i+1)] = A[-(i+1)], A[i]

print(f'Прізвища після зміни: {A}.')