'''49. Задано дві таблиці. Одна містить найменування послуг, а інша - розцінки
за ці послуги. Видаліть з обох таблиць все, що передує послузі, ціна якої G гривень.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.array(['Windows', 'Office', 'Антивірус', 'ПО', 'Гарантія', 'Інше'])
B = np.array([2000, 800, 600, 1500, 1000, 400])
print(f'Послуги: {A}.')
print(f'Ціна: {B}.\n')

index = [] # створюємо список для внесення індексів, що необхідно буде видалити
G = int(input('G: ')) # користувач вводить G
for i in reversed(range(len(B))): # за допомогою reversed ідемо в масиві з кінця до початку
    if (B[i] != G): # поки не зустрічається G, додаємо індекси для видалення
        index.append(i)
    else:
        break # якщо зустріли - вихід із циклу

if(len(index) == len(B)): # якщо довжина списку індексів = довжині масиву, це означає що елемента G не було зустрінуто
    print('У таблиці немає послуги, ціна якої G гривень.')
    exit(0)

A = np.delete(A, index) # за допомогою методу delete видаляємо елементи з вказаними попередньо індексами
B = np.delete(B, index)

print(f'Послуги після виконання програми: {A}.') # вивід
print(f'Ціна після виконання програми: {B}.\n')