'''51. Дан одновимірний масив а. Сформувати новий масив, який складається
тільки з тих елементів масиву а, які перевищують свій номер на 10. Якщо таких
елементів немає, то видати повідомлення.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(0, 50, 20)
print(f'Вихідний масив: {A}.\n')

index = [] # створюємо список для індексів, які будемо видаляти
for i in range(len(A)):
    if not (A[i] - i > 10): # якщо елемент не перевищує свій номер на 10, додаємо його індекс в список для видалення
        index.append(i)

B = np.delete(A, index) # створюємо новий масив, де видаляємо елементи, що не пройшли перевірку

if (len(B) != 0):
    print(f'Новий масив: {B}.\n')
else: # якщо новий масив пустий, то немає таких елементів, що задовільняють умові
    print('Елементів, що задовільняють умову задачі немає.')
