'''52. Знайти найбільший елемент з елементів одновимірного масиву, що мають
парний номер. Визначити, чи є він єдиним.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(0, 50, 20)
print(f'Вихідний масив: {A}.\n')

max = A[::2].max() # знаходимо найбільший елемент із парним номером за допомогою зрізу і методу max
if (list(A).count(max) == 1): # якщо він зустрічається лише раз, то він єдиний в масиві
    count = 'єдиний'
else:
    count = 'не єдиний' # інакше - не єдиний

print(f'Найбільший елемент з парним номером: {max}.\nВін {count}.')