'''53. В масиві X (1: n) кожен елемент рівний 0, 1 або 5. Переставити елементи
масиву так, щоб спочатку розташовувалися всі нулі, потім все одиниці, а потім всі
п'ятірки. Додаткового масиву не заводити.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.choice([0, 1, 5], int(input('Введіть кількість елементів: '))) # створюємо масив із чисел 0, 1 та 5 за допомогою random.choice
print(f'Вихідний масив: {A}.\n')
A.sort() # сортуємо елементи
print(f'Відсортований масив: {A}.') # вивід