'''54. Введіть масив з 20 елементів і визначте, чи є в ньому елементи з
однаковими значеннями.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(0, 300, 20)
print(f'Вихідний масив: {A}.\n')

for i in A:
    if (list(A).count(i) >= 2):
        print('В масиві є елементи з однаковими значеннями.') # якщо елемент зустрічається більше 2-х разів, то в масиві є елементи з однаковими значеннями
        break
else: # якщо цикл завершився без break - в масиві немає елементів з однаковими значеннями
    print('В масиві немає елементів з однаковими значеннями.')