'''55. У будинку, що складається з 30 квартир, переселити мешканців так, щоб
мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29
і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(1, 7, 30) # рандомно заповнимо кількість жителів в квартирах від 1 до 7 людей
print(f'Вихідний масив: {A}.\n')

sum = 0
for i in A:
    if (i > 5): # якщо більше 5 осіб - додаємо +1 до лічильника
        sum += 1

for i in range(len(A) // 2): # міняємо місцями мешканців по квартирах
    A[i], A[-(i+1)] = A[-(i+1)], A[i]

print(f'Кількість квартир, де більше 5 мешканців: {sum}.')
print(f'Кількість мешканців в квартирах після переселення: {A}.')