'''57. Відомість на зарплату представлена як дві таблиці. Одна містить
прізвища працівників цеху, а друга - їх зарплату за поточний місяць. Знайдіть прізвище
працівника, зарплата якого найменш відхиляється від середньої зарплати всіх
працівників за поточний місяць. Знайдіть прізвища двох працівників з найбільшою
заробітною платою. Видаліть з відомості на зарплату відомості про працівника,
зарплата якого мінімальна.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.array(['Трофімов', 'Сидоренко', 'Іванов', 'Карпенко', 'Демчук', 'Макаров', "Петренко"])
B = np.array([6900, 7500, 8000, 7200, 9800, 6500, 8300])
print(f'Вихідний масив з прізвищами: {A}.')
print(f'Вихідний масив з зарплатами: {B}.\n')

mean_list = [] # створюємо масив для визначення наймешого відхилення від середньої зарплатні (для цього будемо віднімати від середньої зарплату працівника; найменша така різниця і буде дорівнювати наймешому відвихленню)
for i in range(len(B)):
    if (B[i] < B.mean()): # якщо зарплата працівника менша за середню, то віднімаємо від середньої
        mean_list.append(B.mean() - B[i])
    elif ((B[i] > B.mean())): # якщо зарплата працівника більша за середню, то віднімаємо від зарплати працывника
        mean_list.append(B[i] - B.mean())
    else: # якщо зарплата працівника дорівнює середній, то це і є найменше відхилення, припиняємо цикл
        average = i
        break
else:
    average = mean_list.index(min(mean_list)) # знаходимо наймеше відхилення за допомогою функції min у списку

max1 = list(B).index(B.max()) # знаходимо максимальне значення за допомогою метода max
max2_list = [] # створюємо пустий список для визначення другого максимального значення (для цього будемо від першого віднімати друге, мінімальне із таких значень і буде другим максимальним)
for i in range(len(B)):
    if (i != max1): # якщо елеменьт не є максимальним, віднімаємо від максимального цей елемент, і заносимо різницю в список
        max2_list.append(B.max() - B[i])
    else: # якщо елемент і є максимумом, то просто додаємо його (оскільки він явно буде більшим за інші елементи у списку, то ми його пропустимо, і знайдемо другий максимальний елемент, бо він буде мінімальним у списку)
        max2_list.append(B.max())

max2 = max2_list.index(min(max2_list)) # знаходимо індекс другого максимального елемента
min = list(B).index(B.min()) # знаходимо індекс мінімального елемента
A_new = np.delete(A, min) # видаляємо прізвище із мінімальним елементом
B_new = np.delete(B, min) # видаляємо мінімальний елемент

print(f'Середня заплата працівників за місяць: {B.mean()}.')
print(f'Працівник, зарплата якого найменш відхиляється від середньої: {A[average]}.')
print(f'Прізвища двох працівників з найбільшою зарплатою: {A[max1]}, {A[max2]}.')
print(f'Масив після видалення працівника з мін. зарплатою: {B_new}.')