'''58. Дан одновимірний масив цілих чисел. Знайдіть, скільки разів в ньому
повторюється найчастіше число.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(0, 20, 15)
print(f'Вихідний масив: {A}.\n')

count = []
for i in A:
    count.append(list(A).count(i)) # додаємо в список кількість входжень кожного елемента

print(f'Найчастіше число повторюється {max(count)} раз(и/ів).') # виводимо максимальну кількість повторень певного елемента