'''59. Дан одновимірний масив з 10 цілих чисел. Підрахуйте кількість різних
чисел в ньому.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(0, 20, 10)
print(f'Вихідний масив: {A}.\n')

print(f'Кількість різних чисел в масиві: {len(set(A))}.') # рахуємо кількість різних чисел, дізнавшись довжину множини, утвореної з масиву