'''6. Створіть масив А [1..8] за допомогою генератора випадкових чисел з
елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
елементів масиву.
Виконав: Лещенко В. О.'''

import numpy as np

A = np.random.randint(-10, 10, 8)
print(f'Вихідний масив: {A}.\n')
sum = 0 # створюємо лічильник
for i in A:
    if (i < 0): # якщо в масиві попадається від'ємне число,
        sum += 1 # додаємо +1 до лічильника

print(f"Кількість від'ємних елементів: {sum}.") # виводимо лічильник