'''9. З 8 до 20 години температура повітря вимірювалася щогодини. Відомо,
що протягом цього часу температура знижувалася. Визначте, о котрій годині було
вперше зафіксовано від'ємну температуру.
Виконав: Лещенко В. О.'''

import numpy as np

temp = np.zeros(13, dtype=int)
temp[-1] = 10000 # робимо останній елемент таким, щоб цикл пройшов першу ітерацію (інакше буде зациклення)
for i in range(13):
    while True: # ставимо while true, щоб повторяти ввід температури, якщо наступну годину температура більша, ніж за попередню (в умові сказано, що вона знижувалась)
        temp[i] = int(input(f'Введіть температуру в {i+8}:00: ')) # користувач вводить
        if (temp[i] >= temp[i-1]): # перевірка чи знижується кожну годину
            print('Температура знижується кожну годину. Введіть повторно!\n') # якщо ні, повторяємо цикл
        else:
            break # інакше - вихід

print(f'\nЩогодинний масив температур: {temp}.\n') # виводимо масив із щогодинними температурами
for i in range(len(temp)):
    if (temp[i] < 0): # якщо зафіксовано від'ємну температуру виводимо її і її час
        print(f"Вперше від'ємну температуру ({temp[i]} ℃) було зафіксовано о {i+8}-й годині.")
        break # завершуємо цикл достроково
else:
    print("Від'ємної температури не було зафіксовано.") # якщо не зпрацював жодного разу break - отже від'ємної температури не було зафіксовано, що і виводимо